
import random

status = input("Введите статус заказа: ").lower().strip()

hours = random.randint(1, 12)
days = random.randint(2, 5)

print("╔══════════════════════════════════════════╗")
print("║      📦 СТАТУС ВАШЕГО ЗАКАЗА 📦          ║")
print("╚══════════════════════════════════════════╝")

match status:
    case "pending":
        print("Статус: ⏳ В ожидании ⏳")
        print("Описание: Заказ ожидает своей очереди")
        print(f"Примерное время: {hours} ч")
    case "processing":
        print("Статус: ⚙️ В обработке ⚙️")
        print("Описание: Ваш заказ скоро отправят")
        print(f"Примерное время: {hours} ч")
    case "shipped":
        print("Статус: ✈️ Отправлено ✈️")
        print("Описание: Ваш заказ в пути к вам")
        print(f"Примерное время: {days} дн.")
    case "delivered":
        print("Статус: ✅ Доставлено ✅")
        print("Описание: Заказ успешно доставлен")
        print("Примерное время: доставка завершена")
    case "cancelled":
        print("Статус:  🛑Отменено 🛑")
        print("Описание: Заказ был отменён")
        print("Примерное время: 0")